In [1]:
from wsi.indicators.education import build_education_df
from wsi.indicators.employment import build_employment_df
from wsi.indicators.parliament import build_parliamentary_df
from wsi.indicators.poverty import build_poverty_df

In [2]:
build_poverty_df()

     ISO_code  Year  Poverty
0         ALB  2002      1.1
1         ALB  2005      0.6
2         ALB  2008      0.2
3         ALB  2012      0.6
4         ALB  2014      1.0
...       ...   ...      ...
1606      ZMB  2004     61.1
1607      ZMB  2006     64.7
1608      ZMB  2010     64.4
1609      ZMB  2015     60.8
1610      ZMB  2022     64.3

[1611 rows x 3 columns]

In [2]:
build_parliamentary_df()

C:\Users\kbuc0011\Documents\WSI\wsi\indicators\parliament.py:43: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df = df.replace({"---": 0, "-": 0, "?": 0}).astype(

     ISO_code  Year  Parliamentary Representation
0         SWE  1997                     40.401146
1         NOR  1997                     39.393939
2         FIN  1997                     33.500000
3         DNK  1997                     32.960894
4         NLD  1997                     31.333333
...       ...   ...                           ...
5424      BGD  2025                      0.000000
5425      KWT  2025                      0.000000
5426      MMR  2025                      0.000000
5427      NER  2025                      0.000000
5428      SDN  2025                      0.000000

[5429 rows x 3 columns]

In [ ]:
edu_world = build_education_df()
edu_world['Year'].max()

np.int64(2023)

In [ ]:
emp_world = build_employment_df()
emp_world

     ISO_code  Year  Employment
0         ABW  2011   69.688359
1         AFG  2008   48.240352
2         AFG  2012   16.858257
3         AFG  2014   22.798185
4         AFG  2017   20.883585
...       ...   ...         ...
2885      ZWE  2014   82.014813
2886      ZWE  2019   68.255373
2887      ZWE  2021   64.499665
2888      ZWE  2022   63.862897
2889      ZWE  2023   65.737269

[2890 rows x 3 columns]

In [4]:
emp_world['Year'].max()

np.int64(2024)